# ColorFillSchemeEntry Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ColorFillSchemeEntry Methods
ColorFillSchemeEntry Class See Also
---
The ColorFillSchemeEntry type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CanSetValue(Double) | Checks whether StorageType of entry is Double and the value is no less than 0.0. |
| CanSetValue(Int32) | Checks whether StorageType of entry is Integer. |
| CanSetValue(ElementId) | Checks whether StorageType of entry is ElementId. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetDoubleValue | Gets the Double value stored within the entry. |
| GetElementIdValue | Gets the ElementId value stored within the entry. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetIntegerValue | Gets the Integer value stored within the entry. |
| GetStringValue | Gets the String value stored within the entry. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetDoubleValue | Sets new Double value of entry. |
| SetElementIdValue | Sets new ElementId value of entry. |
| SetIntegerValue | Sets new Integer value of entry. |
| SetStringValue | Sets new String value of entry. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ColorFillSchemeEntry Class
Autodesk.Revit.DB Namespace